{
  "morning": [
    {
      "dua_in_arabic": "اللَّهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ",
      "dua_in_english": "O Allah! With Your aid we enter the morning and with Your aid we enter the evening. You cause us to live, and You cause us to die, and to You is the Resurrection.",
      "hadith_in_english": "Narrated by Abu Huraira:\n\nWhen the Prophet (ﷺ) entered the morning, he would say:\n\n'O Allah! With Your aid we enter the morning, and with Your aid we enter the evening. You cause us to live, and You cause us to die, and to You is the Resurrection.'",
      "hadith_reference": "Al-Adab al-Mufrad of al-Bukhārī (no. 1199), at-Tirmidhī (no.3391)—graded ṣahīh by al-Albānī.",
      "reference": "https://sunnah.com/adab:1199",
      "repeat": 1
    },
    {
      "dua_in_arabic": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ\n\nاللّهُ لَا إِلٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      "dua_in_english": "Allah! None has the right to be worshipped except Him; the Ever-Living, the Self-subsisting Sustainer of all that exists. Neither drowsiness nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is in the earth. None can intercede with Him except with His permission. He knows whatever lies before them and whatever is behind them, and they cannot encompass anything of His knowledge except what He wills. His Footstool extends over the heavens and the earth, and preserving them does not weary Him; and He is the Exalted One, the Tremendous One.",
      "hadith_in_english": "Narrated Ubayy ibn Ka’b:\n\nHe had a drying place for dates, and he found that they began disappearing, so he guarded it one night and found a creature resembling a boy at the age of puberty. So he gave him the greeting of Salaam, and he replied with the greeting of Salaam. So he said:\n\nWho are you: a jinn or a human?\n\nHe said:\n\nNo, rather I am a Jinn.\n\nHe said:\n\nGive me your hand.\n\nAnd he found that it was the paw of a dog and the hair of a dog. He said:\n\nIs this the physique of the Jinn?\n\nHe said:\n\nThe Jinn know that there is not amongst them a male stronger than me.\n\nHe said:\n\nWhat have you been doing?\n\nHe said:\n\nI was informed that you are a man who loves to give in charity, so we wished to take a share from your food.\n\nHe said:\n\nWhat will safeguard us from you?\n\nHe said:\n\nThis Aayah, which is in Sooratul-Baqarah.",
      "hadith_reference": "4 Al-Hākim in al-Mustadrak (1/562)—and authenticated by Shaikh al-Albānī in Ṣahīh at-Targhīb wat-Tarhīb (1/673).",
      "reference": "https://lifewithallah.com/articles/morning-evening/ayah-al-kursi-the-greatest-protection/#:~:text=3)%20In%20the%20morning%20and,the%20morning%E2%80%9D%20(%E1%B8%A4%C4%81kim).",
      "repeat": 1
    },
    {
      "dua_in_arabic": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n\nقُلْ هُوَ اللَّهُ أَحَدٌ • اللَّهُ الصَّمَدُ • لَمْ يَلِدْ وَلَمْ يُولَدْ • وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ\n\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n\nقُلْ أَعُوذُ بِرَبِّ الْفَلَقِ • مِنْ شَرِّ مَا خَلَقَ • وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ • وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ • وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ\n\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n\nقُلْ أَعُوذُ بِرَبِّ النَّاسِ • مَلِكِ النَّاسِ • إِلَهِ النَّاسِ • مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ • الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ • مِنَ الْجِنَّةِ وَالنَّاسِ",
      "dua_in_english": "Say: 'He is Allah, [Who is] One. Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent.' Say: 'I seek refuge in the Lord of daybreak, from the evil of that which He created, and from the evil of darkness when it settles, and from the evil of the blowers in knots, and from the evil of an envier when he envies.' Say: 'I seek refuge in the Lord of mankind, the Sovereign of mankind, the God of mankind, from the evil of the retreating whisperer— who whispers [evil] into the breasts of mankind— from among the jinn and mankind.'",
      "hadith_in_english": "Narrated Abdullah ibn Khubayb:\n\nWe went out one rainy and intensely dark night to look for the Messenger of Allah (ﷺ) to lead us in prayer. When we found him, he asked:\n\nHave you prayed?\n\nBut I did not say anything. So he said:\n\nSay.\n\nBut I did not say anything. He again said:\n\nSay.\n\nBut I did not say anything. He then said:\n\nSay.\n\nSo I said: What am I to say?\n\nHe said:\n\nSay: \"Say, He is Allah, One,\" and al-Mu'awwadhatan three times in the morning and evening; they will serve you for every purpose.",
      "hadith_reference": "Reported by Abu Dawood and at-Tirmidhī, and graded ṣahīh by Shaikh Al-Albānī in Ṣahīh at-Tirmidhī (3/182).",
      "reference": "https://sunnah.com/abudawud:5082",
      "repeat": 3,
      "explanation":"Whoever recites the above three times in the morning, and three times in the evening, it will suffice him (protect him) from everything."

    },
    {
      "title": "Asking for good of this day and seeking refuge from its evil",
      "dua_in_arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ. لَا إِلَهَ إِلَّا اللَّهُ، وَحْدَهُ لَا شَرِيكَ لَهُ. لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ. * رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ. * رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ. رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.",
      "dua_in_english": "We have entered the morning of a new day whose dominion belongs to Allah, praise is to Allah, none has the right to be worshipped but Allah alone, He has no partner. To Allah belongs the dominion, and to Him is due all praise, and He is over everything All-Able. My Lord, I ask You for the goodness of this day and the goodness that comes after it. I seek refuge with You from the evil of this day and the evil that comes after it. My Lord, I seek refuge with You from laziness and decrepitness of old age. My Lord, I seek refuge in You from the punishment of the Fire, and from the punishment in the grave.",
      "hadith_in_english": "Abdullah reported that when it was evening Allah's Messenger (ﷺ) used to supplicate:\n\n\"We have entered upon evening and so, too, the whole Kingdom of Allah has entered upon evening. Praise is due to Allah. There is no god but Allah, the One having no partner with Him.\"\n\nHe (the narrator) said: I think that he also uttered (in this supplication these words):\n\n\"His is the Sovereignty and to Him is praise due, and He is Potent over everything. O my Lord, I beg of Thee good that lies in this night and good that follows it, and I seek refuge in Thee from the evil that lies in this night and from the evil of that which follows it. O my Lord, I seek refuge in Thee from sloth, from the evil of vanity. O my Lord, I seek refuge in Thee from torment of the Hell-Fire and from torment of the grave.\"\n\nAnd when it was morning, he said something similar:\n\n\"We entered upon morning, and the whole Kingdom of Allah entered upon morning.\"",
      "hadith_reference": "At-Tirmidhī (no. 3390)—graded ṣahīh by al-Albānī",
      "reference": "https://sunnah.com/tirmidhi:3390",
      "repeat": 1,
      "explanation": "Shaykh Abdur-Razzaq Al-Badr (حفظه الله) said:\n\nThis is a beneficial supplication, a superb expression for remembrance of Allah (سبحانه وتعالى), and a blessed act of daily private worship. It is excellent for a Muslim to keep careful observance of every morning and evening, following the pattern of the Noble Prophet (ﷺ) and taking an example from his upright guidance.\n\nThe Prophet’s (ﷺ) saying, in the beginning of this supplication:\n\"We have reached the evening, and at this very time unto Allah belongs all sovereignty, and all praise belongs to Allah…\"\nmeans: We have reached the evening, and the sovereignty is in the control of Allah as it reaches the evening, exclusively His. This is a clarification of the condition of the speaker (i.e., the one reciting these words). He is saying: We have come to know and acknowledge the fact that the kingdom and sovereignty (of the heavens and earth) belong to Allah, and the praise belongs to Allah, not to anyone other than Him. Therefore, we have sought refuge with Him, asked for help and assistance from Him, and devoted all worship, praise, and thanks exclusively for Him, Alone.\n\nFor this reason, he announced—after this—his Iman (true faith) and Tawheed (making all worship for Allah, Alone), saying:\n\"There is nothing which deserves to be worshipped except Allah, Alone, He has no partner…\"\nMeaning: There is nothing truly worthy of worship except Allah. It is necessary to note that the Word of Tawheed, i.e., \"Lā ilāha ill-Allāh,\" consists of two essential pillars, without which the Tawheed will not be realized (i.e., established as a reality in one’s life). These two pillars are:\n1. An-Nafee (Negation): the negation of everything that is worshipped.\n2. Al-Ithbāt (Affirmation): that \"ill-Allāh\" is the affirmation of all worship for Allah, the One Free from all Imperfections.\n\nThe Prophet’s (ﷺ) saying, \"Alone, He has no partner…\" contains re-emphasis of the affirmation of the right of Allah to be worshipped Alone, while \"He has no partner\" entails re-emphasis of the negation of the right of anything besides Allah to be worshipped. This re-emphasis after re-emphasis shows the great care and attention given to the station of Tawheed and the high status of its affair.\n\nOnce he (ﷺ) acknowledged the Unique Oneness of Allah, he followed that with the acknowledgment that to Him belongs the sovereignty, the praise, and the power over everything, saying:\n\"To Him belongs all sovereignty and to Him belongs all praise and He has power over all things.\"\n\nIndeed, the sovereignty—all of it—belongs to Allah, and in His Hand is the control and mastery over all things. Likewise, the praise—all of it—belongs to Him, since He possesses it and because it is His right. And He—the One Free from all Imperfections—has power over all things; nothing is outside of His power and ability.\n\nAllah, the Most High, says:\n\"Allah is not such that anything in the heavens or in the earth can render Him incapable. Indeed, He is All-Knowing, All-Powerful.\"\n[Qur’an, 35:44]\n\nThere is a tremendous benefit in bringing this introductory sentence just before the supplication, as it intensifies the supplication and makes it more likely to be answered. Then, he begins—after these introductory statements—with the mention of his request and his needs, saying:\n\"O my Lord, I ask You for the good of this night and the good of what follows it…\"\nMeaning: I ask You for the best of what You intended to occur in this night for the righteous ones of Your worshipping servants, including those apparent and hidden extra supplements (which complete what is already at hand), as well as those things which benefit one’s religious and worldly affairs; \"and the good of what follows it,\" meaning the best of what is in the nights which will follow.\n\nThe Prophet (ﷺ) saying:\n\"…and I seek refuge in You from the evil of this night and the evil of what follows it\"\nMeaning: I cling to You and seek shelter with You from the evil that You intended to occur in this night, including those evils that are apparent and those which are hidden.\n\nThe Prophet (ﷺ) saying:\n\"O my Lord, I seek refuge in You from laziness and the evil of old age\"\nWhat is meant by \"laziness\" is the failure of the inner self to rise up to achieve good, in spite of it being obvious that one is able to do so. Whoever is like this is not excused, as opposed to the one who is incapable (of doing a certain thing), in which case he is excused due to his inability.\n\nWhat is intended by \"the evil of old age\" is that which is caused by old age, such as a decrease or dwindling of intellectual strength and confusion in one’s thinking or views, as well as the other things which make one’s condition bad.\n\nThe Prophet (ﷺ) saying:\n\"O my Lord, I seek refuge in You from the punishment of the Hellfire and the punishment of the Grave\"\nMeans: I seek protection with You, O Allah, so that the punishment of the Fire and the punishment of the grave will not touch me. The reason why he (ﷺ) singled out these two for mention—from among the rest of the types of punishment on the Day of Resurrection—is due to the severity of these two punishments and the enormity of their affair.\n\nAs for the grave—it is the first station in the Hereafter. Whoever is saved (from punishment) in it will be safe in that which comes after it. As for the Hellfire, its pain is tremendous and its punishment is severe. May Allah protect us and you (from it), and shield us and you (from it).",
      "explanation_source":"‘Fiqh al-Ad’iyah wal-Adhkar’ Shaykh Abdur-Razzaq ibn Abdul-Muhsin al-Badr, Second Edition"
    },
    {
      "title": "Sayyid al-Istighfar (the Master Supplication for Seeking Forgiveness)",
      "dua_in_arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
      "dua_in_english": "O Allah! You are my Lord; none has the right to be worshipped but you. You created me and I am Your slave, and I am faithful to my covenant and my promise as far as I am able. I seek Your refuge from the evil of what I have done. I acknowledge before You all the favors that You have bestowed upon me, and I confess all my sins to You. So forgive me, since none can forgive sins except You.",
      "hadith_in_english": "Reported by al-Bukhari (nos. 6306, 6323) from Shaddad ibn Aws -radiyallaahu `anhu- that the Prophet (ﷺ) said: The most superior manner of seeking forgiveness is to say:\n\n'O Allah! You are my Lord; none has the right to be worshipped but you. You created me and I am Your slave, and I am faithful to my covenant and my promise as far as I am able. I seek Your refuge from the evil of what I have done. I acknowledge before You all the favors that You have bestowed upon me, and I confess all my sins to You. So forgive me, since none can forgive sins except You.'\n\nAnd whoever says it in the daytime, being certain of it, and dies in that day before evening, then he will be from the people of Paradise; and whoever says it in the night, being certain of it, and dies before he enters the morning, then he will be from the people of Paradise.",
      "hadith_reference": "Sahih al-Bukhari 6306, 6323",
      "reference": "https://sunnah.com/bukhari:6306",
      "repeat": 1,
      "explanation": "Shaykh Abdur-Razzaq ibn Abdul-Muhsin Al-Badr (حفظه الله) said:\n\nThis is a tremendous supplication, bringing together the meanings of repentance (Tawbah), humble submission (Tadhallul) to Allah, the Blessed and Most High, and turning back (Inabah) to Him.\n\nThe Prophet (ﷺ) described it as being 'the Master Supplication For Seeking Forgiveness' (Sayyid al-Istighfar). And that was because it surpassed all of the other phrases used for seeking forgiveness in excellence and is higher than the others in status.\n\nFrom among the meanings of 'Sayyid': One who surpasses and excels his people in goodness and rises above them. In a similar manner, this supplication excels and surpasses the other expressions used for seeking forgiveness due to the Prophet (ﷺ) opening it with praise and glorification (ath-Thana’) of Allah, then the acknowledgment that he (ﷺ) is an 'Abd (slave) of Allah, one being cared for, created by Him, the Mighty, the Majestic; and then, acknowledging that He (the One Free from all Imperfections) is the One Who deserves to be worshipped, and that there is none who deserves to be worshipped besides Him.\n\nAlso, acknowledging that he (ﷺ) is abiding by the promise, firm upon the covenant of Eman (faith) in Allah and His Book (al-Qur’an), as well as the rest of His Prophets (عليهم السلام) and Messengers (عليهم السلام); and that he (ﷺ) is adhering to all of this as best he can, in accordance with his strength and ability.\n\nNext, the Prophet (ﷺ) sought refuge in Allah, the One Free from all Imperfections, from the evil of everything that he did, including his shortcomings in fulfilling the obligation of showing gratitude for the bounties and favors bestowed upon him, as well as the evil resulting from his commission of sins.\n\nThen, the Prophet (ﷺ) acknowledged the succession of His blessings and continuous gifts and benevolence. Likewise, he (ﷺ) confessed to whatever sins and acts of disobedience he has committed. Then he (ﷺ) asked Allah, the One Free from Imperfections, for forgiveness (Maghfirah) from all of this, declaring openly that no one can forgive sins besides Him, the One Free from all Imperfections.\n\nThis is the most complete and perfect form of what could possibly be in one’s supplication. For this reason, it is seen as the greatest and most excellent expression of seeking forgiveness and the most beautiful, due to the meanings that it contains which ensure the forgiveness of sins.\n\nThe Prophet’s (ﷺ) saying, in the beginning of this supplication: 'Allahumma' has the same meaning as 'Ya Allah' (O Allah). In this case, the vocative 'Ya' (used for calling out to someone, to get their attention) has been deleted, while al-meem al-mushaddadah (doubled letter 'm') has been substituted for it, at the end of the Majestic expression 'Allah', resulting in the very same meaning.\n\nFor this reason, it is not permissible to combine these two expressions; since a substitute and that which it substitutes for are never used together. Additionally, this expression ('Allahumma') is only used for requesting something (from Allah).\n\nThe Prophet’s (ﷺ) saying: '…You are my Lord, there is nothing which deserves to be worshipped except You; You have created me and I am Your servant…' contains an expression of submission (Tadhallul), humility (Khudoo’) and fragility or brokenness (Inkisār) in front of Allah. It is also an expression of Eman (True Faith) in the Unique Oneness (Wahdāneeyah) of Allah in His Lordship (Ruboobeyyah) and His Divinity (Uloohiyyah).\n\nThe Prophet’s (ﷺ) saying: '…You are my Lord…' means I have no Lord, nor any Creator besides You. And the Lord (ar-Rabb) is the Owner (al-Mālik), the Creator (al-Khāliq), the Provider (ar-Rāziq) and the Controller (al-Mudabbir) of the affairs of all of His creation. So, this is a confirmation and acknowledgement of Tawheed ar-Ruboobeyyah (the Unique Oneness of Allah’s Lordship). For this reason, he (ﷺ) later said: 'You have created me…', meaning, You are my Lord, Who has created me, and I have no Creator besides You.\n\nThe Prophet’s (ﷺ) saying: '…there is nothing which deserves to be worshipped except You…' means: There is nothing which has a right to be worshipped besides You. You, Alone, are the One deserving all worship. And this is the actualization of Tawheed al-Uloohiyyah (the Unique Oneness of Allah’s Right to be worshipped).\n\nFor this reason, he (ﷺ) later said: '…and I am Your servant…', meaning, I am a worshipping servant of You. You are the One Who has a right to all worship, and there is none who has a right to be worshipped besides You.\n\nThe Prophet’s (ﷺ) saying: '…and I am obligated to fulfill Your covenant and Your promise as much as I can…' means: I am obligated to fulfill the covenant that I made with You, and the promise that I made to You, to have true Eman (faith) in You and to be obedient to You and to comply with Your commands — in accordance with my ability and to the extent of my fullest capacity.\n\nIndeed, Allah, the One Free from all Imperfections, does not hold a person responsible except in accordance with his ability.\n\nThe Prophet’s (ﷺ) saying: '…I seek refuge in You from the evil of what I have done…' means: I seek asylum with You, O Allah! And I cling to You for protection, from the evil which I have done: from its evil consequences, its evil end-result, the descending of its penalty, being deprived of forgiveness for it, or that I return to that which is similar to it, whether it be evil actions, disgraceful deeds or despicable characteristics.\n\nThe Prophet’s (ﷺ) saying: '…I acknowledge Your favors upon me…' means: I confess to the enormity of Your generosity to me, and Your unending favor and kindness to me, and this confession implies gratitude to the Benefactor, the One Free from all Imperfections, and being exonerated from ingratitude for these many favors.\n\nThe Prophet’s (ﷺ) saying: '…and I acknowledge my sins…' means: I admit to my sins, i.e., whatever sin, error or mistake that I have committed, including omitting an obligatory duty or committing an unlawful act. This acknowledgement of sins and shortcomings is the way to repentance (Tawbah) and turning back to Allah (Inabah). And whoever admits to his sin and repents from it, Allah turns to him in acceptance of his repentance.\n\nThe Prophet’s (ﷺ) saying: '…so forgive me, for indeed no one forgives sins except You' means: O Allah! Forgive me (for) all of my sins, for indeed Your Mercy is all-encompassing (vast), and You are Liberal (Generous) in Pardoning; no sin is too grave for You to forgive [for one who repents to You]. Indeed, You are the All-Forgiving (al-Ghafoor), the Most Merciful (ar-Raheem). And no one can forgive sins except You!\n\nThe Prophet (ﷺ) sealed this supplication with clarification of the immense reward and abundant recompense which will be achieved by anyone who is careful to recite it each and every morning and evening.\n\nIndeed, the reason why the person who is careful of, and consistent in, the recitation of this supplication achieves this generous promise, tremendous reward and abundant recompense is because he opened his day and closed it acknowledging the Tawheed of Allah in His Lordship (Ruboobeyyah) and His Divinity (Uloohiyyah); then, acknowledging his servitude/worship (of Allah Alone) and the witness of His gifts and acknowledgment of His favors; then, the open announcement of the defects and shortcomings of himself, begging for pardon and forgiveness from the Oft-Forgiving (al-Ghaffar); along with his standing in a posture of humility, submission and surrender (to the Mighty, the Majestic).\n\nThese are all sublime, lofty meanings, and noble characteristics with which he begins and ends the day. Hence, it is befitting that the possessor, or one who observes with care the regular recitation of this supplication be worthy of pardon and forgiveness, freedom from the Hell-Fire and entry into the gardens of Paradise. And we ask Allah, the Most Generous (al-Kareem) for His Favor!",
      "explanation_source":"‘Fiqh al-Ad’iyah wal-Adhkar’ Shaykh Abdur-Razzaq ibn Abdul-Muhsin al-Badr, Second Edition"
    },
    {
      "dua_in_arabic": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.",
      "dua_in_english": "O Allah, give me wellbeing in my body. O Allah, give me wellbeing in my hearing. O Allah, give me wellbeing in my sight. None is worthy of worship besides You. O Allah, I seek refuge with You from disbelief and poverty, and I seek refuge with You from the punishment of the grave. There is none worthy of worship except You.",
      "hadith_in_english": "Narrated by Abu Dawood:\n\nThe Prophet (ﷺ) said:\n\n'O Allah, give me wellbeing in my body. O Allah, give me wellbeing in my hearing. O Allah, give me wellbeing in my sight. None is worthy of worship besides You. O Allah, I seek refuge with You from disbelief and poverty, and I seek refuge with You from the punishment of the grave. There is none worthy of worship except You.'",
      "hadith_reference": "Abu Dawood (no. 5090), Ahmad (5/42), an-Nasā’ī in ‘Amal al-Yawm wal-Laylah (no. 22), Ibn as-Sunni (no. 69), al-Bukhārī in al-Adab al-Mufrad. The isnād was graded hasan by al-Albānī, and Ibn Bāz in Tuhfatul-Akhyār (p. 26).",
      "reference": "https://sunnah.com/abudawud:5090",
      "repeat": 3,
      "title": "This is done daily"
    },
    {
      "dua_in_arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.",
      "dua_in_english": "O Allah! I ask You for well-being and security in this world and in the Hereafter. O Allah! I ask You for pardon and for security in my Religion, my worldly life, my family, and my wealth. O Allah! Conceal my faults and keep me safe from that which I fear. O Allah! Guard me from in front of me and from behind me, and from my right and from my left, and from above me, and I seek refuge in Your greatness from being unexpectedly destroyed from beneath me.",
      "hadith_in_english": "Narrated by Ibn Umar:\n\nAllah’s Messenger (ﷺ) had not used to leave off these supplications whenever he entered the evening and whenever he entered the morning:\n\n'O Allah! I ask You for well-being and security in this world and in the Hereafter. O Allah! I ask You for pardon and for security in my Religion, my worldly life, my family, and my wealth. O Allah! Conceal my faults and keep me safe from that which I fear. O Allah! Guard me from in front of me and from behind me, and from my right and from my left, and from above me, and I seek refuge in Your greatness from being unexpectedly destroyed from beneath me.'",
      "hadith_reference": "Abu Dāwood (no. 5074), Ibn Mājah (no. 3871), al-Bukhārī in Al-Adab al-Mufrad (no. 1200) – graded ṣahīh by al-Albānī.",
      "reference": "https://sunnah.com/abudawud:5074",
      "repeat": 1
    },
    {
      "dua_in_arabic": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
      "dua_in_english": "O Allah, Knower of the unseen and the apparent, the Maker of the heavens and the earth, the Lord of everything and its owner. I bear witness that there is none worthy of worship except You. I seek refuge with You from the evil of my soul, and from the evil of Shayṭān and his helpers from bringing evil upon me or that I should harm any Muslim.",
      "hadith_in_english": "Narrated by At-Tirmidhi:\n\nThe Prophet (ﷺ) instructed Abu Bakr (رضي الله عنه) to recite this each morning and evening:\n\n'O Allah, Knower of the unseen and the apparent, the Maker of the heavens and the earth, the Lord of everything and its owner. I bear witness that there is none worthy of worship except You. I seek refuge with You from the evil of my soul, and from the evil of Shayṭān and his helpers from bringing evil upon me or that I should harm any Muslim.'",
      "hadith_reference": "At-Tirmidhi (no. 3529), Abu Dawood (no. 5067), and al-Bukhārī in al-Adab al-Mufrad (no. 1204). Graded ṣaḥīḥ by al-Albānī.",
      "reference": "https://sunnah.com/abudawud:5067",
      "repeat": 1
    },
    {
      "title": "With the 'Name of Allah' One is Protected from Every Harm in the Heavens and Earth",
      "dua_in_arabic": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
      "dua_in_english": "With the name of Allah, He Whose name is such that when it is mentioned nothing in the earth or the heavens can cause harm, and He is the All-Hearing, the All-Knowing.",
      "hadith_in_english": "Narrated by Uthman ibn Affan:\n\nI heard Allah’s Messenger (ﷺ) say:\n\n'Whoever says:\n\nWith the name of Allah, He Whose name is such that when it is mentioned nothing in the earth or the heavens can cause harm, and He is the All-Hearing, the All-Knowing.'\n\nthree times, will not be struck by sudden calamity until morning; and whoever says it three times in the morning will not be struck by sudden calamity until the evening.",
      "hadith_reference": "Abu Dāwood (no. 5088), at-Tirmidhī (no. 3388), Ibn Mājah (no. 3869), al-Bukhārī in al-Adab al-Mufrad (no. 660)—graded ṣahīh by al-Albānī.",
      "reference": "https://sunnah.com/abudawud:5088",
      "repeat": 3,
      "explanation": "Shaykh Abdur-Razzaq ibn Abdul-Muhsin Al-Badr (حفظه الله) said:\n\nThis is one of the tremendous supplications which is befitting of a Muslim to recite regularly every morning and evening. In this way, he will be protected and preserved — by the permission of Allah — from being afflicted with an unexpected trial or a harmful calamity or something similar to this.\n\nAl-Qurtubee (رحمه الله) said concerning this Hadith: 'This is an authentic report and a truthful statement whose proof we came to know by way of both Daleel (i.e., the evidence in the Hadith) as well as Tajribah (from actual experience). Since I first heard this Hadith I acted upon it, and nothing harmed me until (one day) I did not recite it. As a result, I was stung by a scorpion during the night in Madeenah. When I thought over it, I realized that I had forgotten to seek refuge (in Allah) through these words.'\n\nThe Sunnah concerning these words of remembrance is that they be repeated three times each morning and each evening, just as the Prophet (ﷺ) instructed it to be done.\n\nThe Prophet’s (ﷺ) saying in the Hadith: 'In the name of Allah...' means, 'In the name of Allah I seek refuge (from any harm befalling me).' Every person performing a specific action intends, at the time of saying 'Bismillah,' an appropriate verb that matches their condition. For instance:\n\n- A person eating says, 'Bismillah,' intending, 'In the name of Allah I am eating.'\n- A person slaughtering an animal says, 'Bismillah,' intending, 'In the name of Allah I am slaughtering this animal.'\n- A writer says, 'Bismillah,' intending, 'In the name of Allah I am writing.'\n\nThe Prophet’s (ﷺ) saying: '...with whose name nothing is harmed on the earth nor in the heavens...' means that whoever seeks refuge in the name of Allah will not be harmed by any calamity coming from the earth or the heavens.\n\nThe Prophet’s (ﷺ) saying: '...and He is the All-Hearing (as-Samee’), the All-Knowing (al-Aleem)...' means that Allah is as-Samee’, Who hears the sayings of His servants, and al-Aleem, Who knows their actions. Allah is the One from Whom no secret is hidden in the earth nor in the heaven.",
      "explanation_source": "‘Fiqh al-Ad’iyah wal-Adhkar’ Shaykh Abdur-Razzaq ibn Abdul-Muhsin al-Badr, Second Edition"
    },       
    {
      "dua_in_arabic": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا",
      "dua_in_english": "I am pleased and satisfied with Allah as my Lord, with Islam as my Religion, and with Muhammad as my Prophet.",
      "hadith_in_english": "Narrated al-Munaydhr:\n\nI heard Allaah’s Messenger (ﷺ) say:\n\n\"Whoever says when he enters the morning:\n\n'I am pleased and satisfied with Allah as my Lord, with Islam as my Religion, and with Muhammad as my Prophet,'\n\nthen I guarantee that I will take hold of his hand until I enter him into Paradise.\"",
      "hadith_reference": "Abu Dāwood (no. 1529), Ibn Mājah (no. 3870), at-Tirmiidhī (no. 3389), Ahmad (4/337)—and it was graded ṣahīh by al Albānī.",
      "reference": "https://sunnah.com/hisn:87",
      "repeat": 3
    },
    {
      "dua_in_arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
      "dua_in_english": "O Ever-Living One! O Self-Subsisting Sustainer of everything! By Your mercy I beseech: rectify for me all of my affairs, and do not entrust me to my own self for the blink of an eye.",
      "hadith_in_english": "Narrated by Anas ibn Malik:\n\nThe Prophet (ﷺ) said to Fatimah:\n\n'What could prevent you from listening to what I counsel you with, or that you say when you enter the morning and when you enter the evening:\n\nO Ever-Living One! O Self-Subsisting Sustainer of everything! By Your mercy I beseech: rectify for me all of my affairs, and do not entrust me to my own self for the blink of an eye.'",
      "hadith_reference": "Amalul-Yawm wal-Laylah an-Nasa'i 575",
      "reference": "An-Nasā’ī in as-Sunan al-Kubrā (6/147), al-Hākim (1/730) who graded it ṣahīh, and adh-Dhahabī (1/545) agreed—also al-Albānī in Ṣahīh at-Targheeb wat-Tarheeb (1/273).",
      "repeat": 1
    },
    {
      "dua_in_arabic": "أَصْبَحْنَا عَلَى فِطْرَةِ الإِسْلَامِ، وَكَلِمَةِ الإِخْلاَصِ، وَدِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَمِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا، وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
      "dua_in_english": "We have entered the morning upon the true Religion of Islam, and upon the testification of purity of worship, and upon the Religion of our Prophet Muhammad (ﷺ), and upon the way of our forefather Ibraaheem – who was upon the true Religion of worshipping Allah alone, and he was not from those who associate others with Allah.",
      "hadith_in_english": "Narrated Abdur-Rahmaan ibn Abzaa:\n\nAllaah’s Messenger (ﷺ) used to say when he entered the morning:\n\n\"We have entered the morning upon the true Religion of Islam, and upon the testification of purity of worship, and upon the Religion of our Prophet Muhammad (ﷺ), and upon the way of our forefather Ibraaheem – who was upon the true Religion of worshipping Allah alone, and he was not from those who associate others with Allah.\"",
      "hadith_reference": "Ahmad (3/406, 407 and 5/123) and Ibn as-Sunnī in ʿAmal alYawm wal-Laylah (no. 34). Authenticated by al-Albānī,see Ṣahīh al-Jāmiʿ (no. 8803).",
      "reference": "https://sunnah.com/hisn:90",
      "repeat": 1
    },
    {
      "dua_in_arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
      "dua_in_english": "I declare Allah free of all imperfections, and all praise is for Him.",
      "hadith_in_english": "Narrated by Abu Hurairah -radiyallaahu `anhu:\n\nThe Messenger of Allah (ﷺ) said:\n\n\"Whoever says: 'Subhan-Allahi wa bihamdihi' (I declare Allah free of all imperfections, and all praise is for Him),\n\nwhen he enters the morning, and when he enters the evening one hundred times, then no one will come on the Day of Resurrection with something better than what he comes with, except for one who said the like of what he said, or who added something upon it.\"",
      "hadith_reference": "Sahih Muslim 2692",
      "reference": "https://sunnah.com/muslim:2692",
      "repeat": 100
    },
    {
      "dua_in_arabic": "لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
      "dua_in_english": "None has the right to be worshipped except Allah, alone without partners. To Him belongs all creation and dominion, and to Him belongs all praise. And He is all-powerful and capable over everything.",
      "hadith_in_english": "Narrated by an-Nasāʾī:\n\nThe Prophet (ﷺ) said:\n\n'Whoever recites this ten times in the morning receives ten good deeds, and ten sins are wiped away. He receives the reward equivalent to freeing ten slaves, and Allah protects him from the Shayṭān. And whoever recites it ten times in the evening gets the same reward. The [tired] person who makes this supplication only once in the morning will still get a reward equivalent to freeing a slave from among the descendants of the Prophet Ismāʿeel (عليه السلام). He will have ten good deeds recorded for him, ten evil deeds wiped from him, and is raised in rank by ten degrees. He will be protected from the Shayṭān till the evening. If he recites the same in the evening, he will have a similar recompense until the morning.'\n\nFurthermore, whoever recites it 100 times in a day, he receives the reward equivalent to freeing ten slaves, 100 deeds are wiped away and he is safeguarded from the Shayṭān for that day until the evening. No one comes with better than what he has except the one who has done more.",
      "hadith_reference": "An-Nasāʾī in ʿAmal al-Yawm wal-Laylah (no. 20), authenticated as ṣaḥīḥ in Ṣaḥīḥ at-Targhīb wat-Tarhīb (1/272). Abū Dāwūd (no. 5077), graded ṣaḥīḥ by al-Albānī.",
      "reference": "https://sunnah.com/nasai:20",
      "repeat": 10
    },    
    {
      "dua_in_arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
      "dua_in_english": "Glory is to Allah, and praise is to Him, by the number of His creation, and by the pleasure of Himself, and by the weight of His Throne, and by the extent of His Words.",
      "hadith_in_english": "Narrated by Juwairiya bint Al-Harith:\n\nThe Messenger of Allah (ﷺ) came out from my apartment in the morning as I was busy in observing my dawn prayer. He came back in the forenoon and I was still sitting there. He (ﷺ) said:\n\n'You have been in the same place since I left you?' I said: Yes. Thereupon the Prophet (ﷺ) said:\n\n'I recited four phrases three times after I left you. If these are to be weighed against what you have recited since morning, they would outweigh them:\n\n\"Glory is to Allah, and praise is to Him, by the number of His creation, and by the pleasure of Himself, and by the weight of His Throne, and by the extent of His Words.\"'",
      "hadith_reference": "Sahih Muslim 2726a",
      "reference": "https://sunnah.com/muslim:2726a",
      "repeat": 3
    },
    {
      "dua_in_arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
      "dua_in_english": "O Allah! I ask You for beneficial knowledge, for good and pure provision, and for deeds which are accepted (by You).",
      "hadith_in_english": "Narrated Umm Salamah:\n\nThe Prophet (ﷺ) used to say, when he had prayed the Dawn Prayer, when he had given Salutation:\n\n\"O Allah! I ask You for beneficial knowledge, for good and pure provision, and for deeds which are accepted (by You).\"",
      "hadith_reference": "Reported by Ibn Mājah (no. 925). Graded ṣahīh by al-Albānī.",
      "reference": "https://sunnah.com/ibnmajah:925",
      "repeat": 1
    },
    {
      "dua_in_arabic": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
      "dua_in_english": "I seek Allah’s forgiveness and repent to Him.",
      "hadith_in_english": "Narrated by the Messenger of Allah (ﷺ):\n\n'He instructed the believers to seek forgiveness as he himself would seek forgiveness 100 times each day.'\n\nIn a narration, he said: 'By Allah, I seek Allah’s forgiveness and repent to Him more than 100 times in a day.'",
      "hadith_reference": "Muslim (no. 2702), Al-Bukhārī (no. 6307).",
      "reference": "https://sunnah.com/muslim:2702",
      "repeat": 100
    },    
    {
      "dua_in_arabic": "اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ\nاللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ",
      "dua_in_english": "O Allah! Protect me from the Fire!\nO Allah! I ask You for Paradise!",
      "hadith_in_english": "Narrated by Abu Hurairah:\n\nAllah's Messenger (ﷺ) said:\n\n\"No servant seeks protection from the Fire seven times in a day except that the Fire says: 'O my Lord! Your servant so and so has sought Your protection from me, so grant him protection.' And no servant asks Allah for Paradise seven times in a day except that Paradise says: 'O my Lord! Your servant so and so has asked for me, so admit him into Paradise.'\"",
      "hadith_reference": "Aboo Ya’laa (4/1472-1473)",
      "reference": "https://preciousgemsfromthequranandsunnah.wordpress.com/2018/11/14/seeking-refuge-from-the-fire-and-asking-for-paradise-seven-times-a-day/",
      "repeat": 7
    },
    {
      "title": "Allah is Sufficient for Me; Upon Him, Alone, I Rely and Depend",
      "dua_in_arabic": "حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
      "dua_in_english": "Allah is sufficient for me; there is none who deserves to be worshipped except Him; I rely upon Him, and He is the Lord of the Magnificent Throne.",
      "hadith_in_english": "From among the words of remembrance to be recited at both ends of the day (i.e., morning and evening) is that which is reported by Ibn Sunnee, from Aboo ad-Dardaa’ (رضي الله عنه), from the Prophet (ﷺ):\n\n'Whoever recites seven times — every day — when he reaches the morning and when he reaches the evening:\n\n“Allah is sufficient for me; there is none who deserves to be worshipped except Him; I rely upon Him, and He is the Lord of the Magnificent Throne,”\n\nAllah will suffice him his concerns from the affairs of this world and the Hereafter.'\n\n[Fortress of the Muslim, no. 83. Reported by Ibn Sunnee in ‘Amal al-Yawm wal-Laylah,’ no. 71, as a Marfoo’ Hadith [i.e., attributed to the Prophet (ﷺ) as his statement].\n\nIt has also been reported by Aboo Daawood in his ‘Sunan,’ no. 5081, with a chain of narrators who are all reliable, as a Mawqoof statement [i.e., attributed to a companion (RadiyAllāhu ‘an-hu)].\n\nal-Albānee (Rahimahullāh) declared it to be authentic in Silsilatul-Ahadeeth ad-Da’eefah, no. 5286, as a Mawqoof statement [i.e., as a statement of Aboo ad-Dardā’ (RadiyAllāhu ‘an-hu)].\n\nAnd this kind of statement cannot be made simply based upon opinion and independent judgment; rather, it could only have come by way of being heard from the Prophet (ﷺ)].",
      "hadith_reference": "Fortress of the Muslim, no. 83",
      "reference": "https://sunnah.com/",
      "repeat": 7,
      "explanation": "Shaykh Abdur-Razzaq ibn Abdul-Muhsin Al-Badr (حفظه الله) said:\n\nThis blessed statement of praise of Allah contains a far-reaching effect and a tremendous benefit in every matter which is important to a Muslim, from the affairs of this world and the Hereafter. The meaning of HasbiyAllah is that Allah will give me that which is sufficient for all of my needs.\n\n[Translator’s Note: This supplication, which the Prophet (ﷺ) has ordered us to recite, also came in the saying of Allah, the Most High:\n\n“...And if they turn away, then say: Allah is sufficient for me; there is none who deserves to be worshipped except Him; I rely upon Him, and He is the Lord of the Magnificent Throne.” (Qur’an, 9:129)]\n\nThe meaning of this Ayah is that if the disbelievers turn away from what you have come to them with, i.e., this comprehensive, perfect, pure, magnificent divine law — then recite to them this supplication:\n\n- HasbiyAllah: Allah is sufficient for me.\n- La ilaha illa Huwa: There is nothing that is worthy of being worshipped except Him.\n- ‘Alaihi Tawakkaltu: I have depended/rely upon Him, and surrendered all of my affairs to Him.\n- Wa Huwa Rabbul-‘Arshil-‘Adheem: He is the Master and Creator of everything. Since He is the Rabb (Lord) of the Magnificent Throne — and the Prophet (ﷺ) singled out the Throne for special mention since it is the greatest of all creations — hence, everything (created) that is less than the Throne is more rightly so included (as being under the lordship and mastery of the One Who is Lord and Master of the Magnificent Throne).",
      "explanation_source": "‘Fiqh al-Ad’iyah wal-Adhkar’ Shaykh Abdur-Razzaq ibn Abdul-Muhsin al-Badr, Second Edition"
    }
    
  ],
  "evening": [
    {
      "dua_in_arabic": "اللَّهُمَّ بِكَ أَمْسَيْنَا وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ الْمَصِيرُ",
      "dua_in_english": "O Allah! With Your aid, we enter the evening, and with Your aid, we enter the morning. You cause us to live, and You cause us to die, and to You is the final return.",
      "hadith_in_english": "Reported by Al-Bukhaaree in ‘al-Adabul-Mufrad’ (no. 1199) from Aboo Hurairah -radiyallaahu `anhu- who said:\n\n\"When the Prophet (ﷺ) entered the evening, he would say:\n\n'O Allah! With Your aid, we enter the evening, and with Your aid, we enter the morning. You cause us to live, and You cause us to die, and to You is the final return.'\"",
      "hadith_reference": "Al-Adab al-Mufrad of al-Bukhārī (no. 1199), at-Tirmidhī (no.3391)—graded ṣahīh by al-Albānī.",
      "reference": "https://sunnah.com/adab:1199",
      "repeat": 1
    },
    {
      "dua_in_arabic": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ\n\nاللّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      "dua_in_english": "Allah! None has the right to be worshipped except Him; the Ever-Living, the Self-subsisting Sustainer of all that exists. Neither drowsiness nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is in the earth. None can intercede with Him except with His permission. He knows whatever lies before them and whatever is behind them, and they cannot encompass anything of His knowledge except what He wills. His Footstool extends over the heavens and the earth, and preserving them does not weary Him; and He is the Exalted One, the Tremendous One.",
      "hadith_in_english": "Narrated Ubayy ibn Ka’b:\n\nHe had a drying place for dates, and he found that they began disappearing, so he guarded it one night and found a creature resembling a boy at the age of puberty. So he gave him the greeting of Salaam, and he replied with the greeting of Salaam. So he said:\n\nWho are you: a jinn or a human?\n\nHe said:\n\nNo, rather I am a Jinn.\n\nHe said:\n\nGive me your hand.\n\nAnd he found that it was the paw of a dog and the hair of a dog. He said:\n\nIs this the physique of the Jinn?\n\nHe said:\n\nThe Jinn know that there is not amongst them a male stronger than me.\n\nHe said:\n\nWhat have you been doing?\n\nHe said:\n\nI was informed that you are a man who loves to give in charity, so we wished to take a share from your food.\n\nHe said:\n\nWhat will safeguard us from you?\n\nHe said:\n\nThis Aayah, which is in Sooratul-Baqarah.",
      "hadith_reference": "4 Al-Hākim in al-Mustadrak (1/562)—and authenticated by Shaikh al-Albānī in Ṣahīh at-Targhīb wat-Tarhīb (1/673).",
      "reference": "https://lifewithallah.com/articles/morning-evening/ayah-al-kursi-the-greatest-protection/#:~:text=3)%20In%20the%20morning%20and,the%20morning%E2%80%9D%20(%E1%B8%A4%C4%81kim).",
      "repeat": 1
    },
    {
      "dua_in_arabic": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n\nقُلْ هُوَ اللَّهُ أَحَدٌ • اللَّهُ الصَّمَدُ • لَمْ يَلِدْ وَلَمْ يُولَدْ • وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ\n\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n\nقُلْ أَعُوذُ بِرَبِّ الْفَلَقِ • مِنْ شَرِّ مَا خَلَقَ • وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ • وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ • وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ\n\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n\nقُلْ أَعُوذُ بِرَبِّ النَّاسِ • مَلِكِ النَّاسِ • إِلَهِ النَّاسِ • مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ • الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ • مِنَ الْجِنَّةِ وَالنَّاسِ",
      "dua_in_english": "Say: 'He is Allah, [Who is] One. Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent.' Say: 'I seek refuge in the Lord of daybreak, from the evil of that which He created, and from the evil of darkness when it settles, and from the evil of the blowers in knots, and from the evil of an envier when he envies.' Say: 'I seek refuge in the Lord of mankind, the Sovereign of mankind, the God of mankind, from the evil of the retreating whisperer— who whispers [evil] into the breasts of mankind— from among the jinn and mankind.'",
      "hadith_in_english": "Narrated Abdullah ibn Khubayb:\n\nWe went out one rainy and intensely dark night to look for the Messenger of Allah (ﷺ) to lead us in prayer. When we found him, he asked:\n\nHave you prayed?\n\nBut I did not say anything. So he said:\n\nSay.\n\nBut I did not say anything. He again said:\n\nSay.\n\nBut I did not say anything. He then said:\n\nSay.\n\nSo I said: What am I to say?\n\nHe said:\n\nSay: \"Say, He is Allah, One,\" and al-Mu'awwadhatan three times in the morning and evening; they will serve you for every purpose.",
      "hadith_reference": "Reported by Abu Dawood and at-Tirmidhī, and graded ṣahīh by Shaikh Al-Albānī in Ṣahīh at-Tirmidhī (3/182).",
      "reference": "https://sunnah.com/abudawud:5082",
      "repeat": 3,
      "explanation":"Whoever recites the above three times in the morning, and three times in the evening, it will suffice him (protect him) from everything."
    },
    {
      "title": "Asking for good of this evening and seeking refuge from its evil",
      "dua_in_arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ. لَا إِلَهَ إِلَّا اللَّهُ، وَحْدَهُ لَا شَرِيكَ لَهُ. لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ. * رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا. * رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ. رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.",
      "dua_in_english": "We have entered the evening of a new night whose dominion belongs to Allah, praise is to Allah, none has the right to be worshipped but Allah alone, He has no partner. To Allah belongs the dominion, and to Him is due all praise, and He is over everything All-Able. My Lord, I ask You for the goodness of this night and the goodness that comes after it. I seek refuge with You from the evil of this night and the evil that comes after it. My Lord, I seek refuge with You from laziness and decrepitness of old age. My Lord, I seek refuge in You from the punishment of the Fire, and from the punishment in the grave.",      "hadith_in_english": "Reported by Muslim (no. 2723) from `Abdullah ibn Mas`ood -radiyallaahu `anhu- said: When Allaah’s Messenger (ﷺ) entered the evening he would say:\n\n\"We have entered the evening, and Sovereignty has entered the evening being for Allaah alone, and all praise is for Allaah. None has the right to be worshipped except Allaah alone, having no partner. Sovereignty is for Him, and all praise is for Him, and He has full power over everything. O Allaah! I ask You for the good that lies in this night and for the good of what comes after it, and I seek refuge in You from the evil that lies in this night and from the evil of what comes after it. O my Lord! I seek refuge in You from laziness and decrepit old age, and I seek refuge in You from punishment in the fire, and from punishment in the grave.\"",
      "hadith_reference": "At-Tirmidhī (no. 3390)—graded ṣahīh by al-Albānī.",
      "reference": "https://sunnah.com/tirmidhi:3390",
      "repeat": 1,
      "explanation": "Shaykh Abdur-Razzaq Al-Badr (حفظه الله) said:\n\nThis is a beneficial supplication, a superb expression for remembrance of Allah (سبحانه وتعالى), and a blessed act of daily private worship. It is excellent for a Muslim to keep careful observance of every morning and evening, following the pattern of the Noble Prophet (ﷺ) and taking an example from his upright guidance.\n\nThe Prophet’s (ﷺ) saying, in the beginning of this supplication:\n\"We have reached the evening, and at this very time unto Allah belongs all sovereignty, and all praise belongs to Allah…\"\nmeans: We have reached the evening, and the sovereignty is in the control of Allah as it reaches the evening, exclusively His. This is a clarification of the condition of the speaker (i.e., the one reciting these words). He is saying: We have come to know and acknowledge the fact that the kingdom and sovereignty (of the heavens and earth) belong to Allah, and the praise belongs to Allah, not to anyone other than Him. Therefore, we have sought refuge with Him, asked for help and assistance from Him, and devoted all worship, praise, and thanks exclusively for Him, Alone.\n\nFor this reason, he announced—after this—his Iman (true faith) and Tawheed (making all worship for Allah, Alone), saying:\n\"There is nothing which deserves to be worshipped except Allah, Alone, He has no partner…\"\nMeaning: There is nothing truly worthy of worship except Allah. It is necessary to note that the Word of Tawheed, i.e., \"Lā ilāha ill-Allāh,\" consists of two essential pillars, without which the Tawheed will not be realized (i.e., established as a reality in one’s life). These two pillars are:\n1. An-Nafee (Negation): the negation of everything that is worshipped.\n2. Al-Ithbāt (Affirmation): that \"ill-Allāh\" is the affirmation of all worship for Allah, the One Free from all Imperfections.\n\nThe Prophet’s (ﷺ) saying, \"Alone, He has no partner…\" contains re-emphasis of the affirmation of the right of Allah to be worshipped Alone, while \"He has no partner\" entails re-emphasis of the negation of the right of anything besides Allah to be worshipped. This re-emphasis after re-emphasis shows the great care and attention given to the station of Tawheed and the high status of its affair.\n\nOnce he (ﷺ) acknowledged the Unique Oneness of Allah, he followed that with the acknowledgment that to Him belongs the sovereignty, the praise, and the power over everything, saying:\n\"To Him belongs all sovereignty and to Him belongs all praise and He has power over all things.\"\n\nIndeed, the sovereignty—all of it—belongs to Allah, and in His Hand is the control and mastery over all things. Likewise, the praise—all of it—belongs to Him, since He possesses it and because it is His right. And He—the One Free from all Imperfections—has power over all things; nothing is outside of His power and ability.\n\nAllah, the Most High, says:\n\"Allah is not such that anything in the heavens or in the earth can render Him incapable. Indeed, He is All-Knowing, All-Powerful.\"\n[Qur’an, 35:44]\n\nThere is a tremendous benefit in bringing this introductory sentence just before the supplication, as it intensifies the supplication and makes it more likely to be answered. Then, he begins—after these introductory statements—with the mention of his request and his needs, saying:\n\"O my Lord, I ask You for the good of this night and the good of what follows it…\"\nMeaning: I ask You for the best of what You intended to occur in this night for the righteous ones of Your worshipping servants, including those apparent and hidden extra supplements (which complete what is already at hand), as well as those things which benefit one’s religious and worldly affairs; \"and the good of what follows it,\" meaning the best of what is in the nights which will follow.\n\nThe Prophet (ﷺ) saying:\n\"…and I seek refuge in You from the evil of this night and the evil of what follows it\"\nMeaning: I cling to You and seek shelter with You from the evil that You intended to occur in this night, including those evils that are apparent and those which are hidden.\n\nThe Prophet (ﷺ) saying:\n\"O my Lord, I seek refuge in You from laziness and the evil of old age\"\nWhat is meant by \"laziness\" is the failure of the inner self to rise up to achieve good, in spite of it being obvious that one is able to do so. Whoever is like this is not excused, as opposed to the one who is incapable (of doing a certain thing), in which case he is excused due to his inability.\n\nWhat is intended by \"the evil of old age\" is that which is caused by old age, such as a decrease or dwindling of intellectual strength and confusion in one’s thinking or views, as well as the other things which make one’s condition bad.\n\nThe Prophet (ﷺ) saying:\n\"O my Lord, I seek refuge in You from the punishment of the Hellfire and the punishment of the Grave\"\nMeans: I seek protection with You, O Allah, so that the punishment of the Fire and the punishment of the grave will not touch me. The reason why he (ﷺ) singled out these two for mention—from among the rest of the types of punishment on the Day of Resurrection—is due to the severity of these two punishments and the enormity of their affair.\n\nAs for the grave—it is the first station in the Hereafter. Whoever is saved (from punishment) in it will be safe in that which comes after it. As for the Hellfire, its pain is tremendous and its punishment is severe. May Allah protect us and you (from it), and shield us and you (from it).",
      "explanation_source":"‘Fiqh al-Ad’iyah wal-Adhkar’ Shaykh Abdur-Razzaq ibn Abdul-Muhsin al-Badr, Second Edition"
    },
    {
      "title": "Sayyid al-Istighfar (the Master Supplication for Seeking Forgiveness)",
      "dua_in_arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
      "dua_in_english": "O Allah! You are my Lord; none has the right to be worshipped but you. You created me and I am Your slave, and I am faithful to my covenant and my promise as far as I am able. I seek Your refuge from the evil of what I have done. I acknowledge before You all the favors that You have bestowed upon me, and I confess all my sins to You. So forgive me, since none can forgive sins except You.",
      "hadith_in_english": "Reported by al-Bukhari (nos. 6306, 6323) from Shaddad ibn Aws -radiyallaahu `anhu- that the Prophet (ﷺ) said: The most superior manner of seeking forgiveness is to say:\n\n'O Allah! You are my Lord; none has the right to be worshipped but you. You created me and I am Your slave, and I am faithful to my covenant and my promise as far as I am able. I seek Your refuge from the evil of what I have done. I acknowledge before You all the favors that You have bestowed upon me, and I confess all my sins to You. So forgive me, since none can forgive sins except You.'\n\nAnd whoever says it in the daytime, being certain of it, and dies in that day before evening, then he will be from the people of Paradise; and whoever says it in the night, being certain of it, and dies before he enters the morning, then he will be from the people of Paradise.",
      "hadith_reference": "Sahih al-Bukhari 6306, 6323",
      "reference": "https://sunnah.com/bukhari:6306",
      "repeat": 1,
      "explanation": "Shaykh Abdur-Razzaq ibn Abdul-Muhsin Al-Badr (حفظه الله) said:\n\nThis is a tremendous supplication, bringing together the meanings of repentance (Tawbah), humble submission (Tadhallul) to Allah, the Blessed and Most High, and turning back (Inabah) to Him.\n\nThe Prophet (ﷺ) described it as being 'the Master Supplication For Seeking Forgiveness' (Sayyid al-Istighfar). And that was because it surpassed all of the other phrases used for seeking forgiveness in excellence and is higher than the others in status.\n\nFrom among the meanings of 'Sayyid': One who surpasses and excels his people in goodness and rises above them. In a similar manner, this supplication excels and surpasses the other expressions used for seeking forgiveness due to the Prophet (ﷺ) opening it with praise and glorification (ath-Thana’) of Allah, then the acknowledgment that he (ﷺ) is an 'Abd (slave) of Allah, one being cared for, created by Him, the Mighty, the Majestic; and then, acknowledging that He (the One Free from all Imperfections) is the One Who deserves to be worshipped, and that there is none who deserves to be worshipped besides Him.\n\nAlso, acknowledging that he (ﷺ) is abiding by the promise, firm upon the covenant of Eman (faith) in Allah and His Book (al-Qur’an), as well as the rest of His Prophets (عليهم السلام) and Messengers (عليهم السلام); and that he (ﷺ) is adhering to all of this as best he can, in accordance with his strength and ability.\n\nNext, the Prophet (ﷺ) sought refuge in Allah, the One Free from all Imperfections, from the evil of everything that he did, including his shortcomings in fulfilling the obligation of showing gratitude for the bounties and favors bestowed upon him, as well as the evil resulting from his commission of sins.\n\nThen, the Prophet (ﷺ) acknowledged the succession of His blessings and continuous gifts and benevolence. Likewise, he (ﷺ) confessed to whatever sins and acts of disobedience he has committed. Then he (ﷺ) asked Allah, the One Free from Imperfections, for forgiveness (Maghfirah) from all of this, declaring openly that no one can forgive sins besides Him, the One Free from all Imperfections.\n\nThis is the most complete and perfect form of what could possibly be in one’s supplication. For this reason, it is seen as the greatest and most excellent expression of seeking forgiveness and the most beautiful, due to the meanings that it contains which ensure the forgiveness of sins.\n\nThe Prophet’s (ﷺ) saying, in the beginning of this supplication: 'Allahumma' has the same meaning as 'Ya Allah' (O Allah). In this case, the vocative 'Ya' (used for calling out to someone, to get their attention) has been deleted, while al-meem al-mushaddadah (doubled letter 'm') has been substituted for it, at the end of the Majestic expression 'Allah', resulting in the very same meaning.\n\nFor this reason, it is not permissible to combine these two expressions; since a substitute and that which it substitutes for are never used together. Additionally, this expression ('Allahumma') is only used for requesting something (from Allah).\n\nThe Prophet’s (ﷺ) saying: '…You are my Lord, there is nothing which deserves to be worshipped except You; You have created me and I am Your servant…' contains an expression of submission (Tadhallul), humility (Khudoo’) and fragility or brokenness (Inkisār) in front of Allah. It is also an expression of Eman (True Faith) in the Unique Oneness (Wahdāneeyah) of Allah in His Lordship (Ruboobeyyah) and His Divinity (Uloohiyyah).\n\nThe Prophet’s (ﷺ) saying: '…You are my Lord…' means I have no Lord, nor any Creator besides You. And the Lord (ar-Rabb) is the Owner (al-Mālik), the Creator (al-Khāliq), the Provider (ar-Rāziq) and the Controller (al-Mudabbir) of the affairs of all of His creation. So, this is a confirmation and acknowledgement of Tawheed ar-Ruboobeyyah (the Unique Oneness of Allah’s Lordship). For this reason, he (ﷺ) later said: 'You have created me…', meaning, You are my Lord, Who has created me, and I have no Creator besides You.\n\nThe Prophet’s (ﷺ) saying: '…there is nothing which deserves to be worshipped except You…' means: There is nothing which has a right to be worshipped besides You. You, Alone, are the One deserving all worship. And this is the actualization of Tawheed al-Uloohiyyah (the Unique Oneness of Allah’s Right to be worshipped).\n\nFor this reason, he (ﷺ) later said: '…and I am Your servant…', meaning, I am a worshipping servant of You. You are the One Who has a right to all worship, and there is none who has a right to be worshipped besides You.\n\nThe Prophet’s (ﷺ) saying: '…and I am obligated to fulfill Your covenant and Your promise as much as I can…' means: I am obligated to fulfill the covenant that I made with You, and the promise that I made to You, to have true Eman (faith) in You and to be obedient to You and to comply with Your commands — in accordance with my ability and to the extent of my fullest capacity.\n\nIndeed, Allah, the One Free from all Imperfections, does not hold a person responsible except in accordance with his ability.\n\nThe Prophet’s (ﷺ) saying: '…I seek refuge in You from the evil of what I have done…' means: I seek asylum with You, O Allah! And I cling to You for protection, from the evil which I have done: from its evil consequences, its evil end-result, the descending of its penalty, being deprived of forgiveness for it, or that I return to that which is similar to it, whether it be evil actions, disgraceful deeds or despicable characteristics.\n\nThe Prophet’s (ﷺ) saying: '…I acknowledge Your favors upon me…' means: I confess to the enormity of Your generosity to me, and Your unending favor and kindness to me, and this confession implies gratitude to the Benefactor, the One Free from all Imperfections, and being exonerated from ingratitude for these many favors.\n\nThe Prophet’s (ﷺ) saying: '…and I acknowledge my sins…' means: I admit to my sins, i.e., whatever sin, error or mistake that I have committed, including omitting an obligatory duty or committing an unlawful act. This acknowledgement of sins and shortcomings is the way to repentance (Tawbah) and turning back to Allah (Inabah). And whoever admits to his sin and repents from it, Allah turns to him in acceptance of his repentance.\n\nThe Prophet’s (ﷺ) saying: '…so forgive me, for indeed no one forgives sins except You' means: O Allah! Forgive me (for) all of my sins, for indeed Your Mercy is all-encompassing (vast), and You are Liberal (Generous) in Pardoning; no sin is too grave for You to forgive [for one who repents to You]. Indeed, You are the All-Forgiving (al-Ghafoor), the Most Merciful (ar-Raheem). And no one can forgive sins except You!\n\nThe Prophet (ﷺ) sealed this supplication with clarification of the immense reward and abundant recompense which will be achieved by anyone who is careful to recite it each and every morning and evening.\n\nIndeed, the reason why the person who is careful of, and consistent in, the recitation of this supplication achieves this generous promise, tremendous reward and abundant recompense is because he opened his day and closed it acknowledging the Tawheed of Allah in His Lordship (Ruboobeyyah) and His Divinity (Uloohiyyah); then, acknowledging his servitude/worship (of Allah Alone) and the witness of His gifts and acknowledgment of His favors; then, the open announcement of the defects and shortcomings of himself, begging for pardon and forgiveness from the Oft-Forgiving (al-Ghaffar); along with his standing in a posture of humility, submission and surrender (to the Mighty, the Majestic).\n\nThese are all sublime, lofty meanings, and noble characteristics with which he begins and ends the day. Hence, it is befitting that the possessor, or one who observes with care the regular recitation of this supplication be worthy of pardon and forgiveness, freedom from the Hell-Fire and entry into the gardens of Paradise. And we ask Allah, the Most Generous (al-Kareem) for His Favor!",
      "explanation_source":"‘Fiqh al-Ad’iyah wal-Adhkar’ Shaykh Abdur-Razzaq ibn Abdul-Muhsin al-Badr, Second Edition"
    },
    {
      "dua_in_arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.",
      "dua_in_english": "O Allah! I ask You for well-being and security in this world and in the Hereafter. O Allah! I ask You for pardon and for security in my Religion, my worldly life, my family, and my wealth. O Allah! Conceal my faults and keep me safe from that which I fear. O Allah! Guard me from in front of me and from behind me, and from my right and from my left, and from above me, and I seek refuge in Your greatness from being unexpectedly destroyed from beneath me.",
      "hadith_in_english": "Narrated by Ibn Umar:\n\nAllah’s Messenger (ﷺ) had not used to leave off these supplications whenever he entered the evening and whenever he entered the morning:\n\n'O Allah! I ask You for well-being and security in this world and in the Hereafter. O Allah! I ask You for pardon and for security in my Religion, my worldly life, my family, and my wealth. O Allah! Conceal my faults and keep me safe from that which I fear. O Allah! Guard me from in front of me and from behind me, and from my right and from my left, and from above me, and I seek refuge in Your greatness from being unexpectedly destroyed from beneath me.'",
      "hadith_reference": "Abu Dāwood (no. 5074), Ibn Mājah (no. 3871), al-Bukhārī in Al-Adab al-Mufrad (no. 1200) – graded ṣahīh by al-Albānī.",
      "reference": "https://sunnah.com/abudawud:5074",
      "repeat": 1
    },
    {
      "dua_in_arabic": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
      "dua_in_english": "O Allah, Knower of the unseen and the apparent, the Maker of the heavens and the earth, the Lord of everything and its owner. I bear witness that there is none worthy of worship except You. I seek refuge with You from the evil of my soul, and from the evil of Shayṭān and his helpers from bringing evil upon me or that I should harm any Muslim.",
      "hadith_in_english": "Narrated by At-Tirmidhi:\n\nThe Prophet (ﷺ) instructed Abu Bakr (رضي الله عنه) to recite this each morning and evening:\n\n'O Allah, Knower of the unseen and the apparent, the Maker of the heavens and the earth, the Lord of everything and its owner. I bear witness that there is none worthy of worship except You. I seek refuge with You from the evil of my soul, and from the evil of Shayṭān and his helpers from bringing evil upon me or that I should harm any Muslim.'",
      "hadith_reference": "At-Tirmidhi (no. 3529), Abu Dawood (no. 5067), and al-Bukhārī in al-Adab al-Mufrad (no. 1204). Graded ṣaḥīḥ by al-Albānī.",
      "reference": "https://sunnah.com/abudawud:5067",
      "repeat": 1
    },
    {
      "title": "With the 'Name of Allah' One is Protected from Every Harm in the Heavens and Earth",
      "dua_in_arabic": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
      "dua_in_english": "With the name of Allah, He Whose name is such that when it is mentioned nothing in the earth or the heavens can cause harm, and He is the All-Hearing, the All-Knowing.",
      "hadith_in_english": "Narrated by Uthman ibn Affan:\n\nI heard Allah’s Messenger (ﷺ) say:\n\n'Whoever says:\n\nWith the name of Allah, He Whose name is such that when it is mentioned nothing in the earth or the heavens can cause harm, and He is the All-Hearing, the All-Knowing.'\n\nthree times, will not be struck by sudden calamity until morning; and whoever says it three times in the morning will not be struck by sudden calamity until the evening.",
      "hadith_reference": "Abu Dāwood (no. 5088), at-Tirmidhī (no. 3388), Ibn Mājah (no. 3869), al-Bukhārī in al-Adab al-Mufrad (no. 660)—graded ṣahīh by al-Albānī.",
      "reference": "https://sunnah.com/abudawud:5088",
      "repeat": 3,
      "explanation": "Shaykh Abdur-Razzaq ibn Abdul-Muhsin Al-Badr (حفظه الله) said:\n\nThis is one of the tremendous supplications which is befitting of a Muslim to recite regularly every morning and evening. In this way, he will be protected and preserved — by the permission of Allah — from being afflicted with an unexpected trial or a harmful calamity or something similar to this.\n\nAl-Qurtubee (رحمه الله) said concerning this Hadith: 'This is an authentic report and a truthful statement whose proof we came to know by way of both Daleel (i.e., the evidence in the Hadith) as well as Tajribah (from actual experience). Since I first heard this Hadith I acted upon it, and nothing harmed me until (one day) I did not recite it. As a result, I was stung by a scorpion during the night in Madeenah. When I thought over it, I realized that I had forgotten to seek refuge (in Allah) through these words.'\n\nThe Sunnah concerning these words of remembrance is that they be repeated three times each morning and each evening, just as the Prophet (ﷺ) instructed it to be done.\n\nThe Prophet’s (ﷺ) saying in the Hadith: 'In the name of Allah...' means, 'In the name of Allah I seek refuge (from any harm befalling me).' Every person performing a specific action intends, at the time of saying 'Bismillah,' an appropriate verb that matches their condition. For instance:\n\n- A person eating says, 'Bismillah,' intending, 'In the name of Allah I am eating.'\n- A person slaughtering an animal says, 'Bismillah,' intending, 'In the name of Allah I am slaughtering this animal.'\n- A writer says, 'Bismillah,' intending, 'In the name of Allah I am writing.'\n\nThe Prophet’s (ﷺ) saying: '...with whose name nothing is harmed on the earth nor in the heavens...' means that whoever seeks refuge in the name of Allah will not be harmed by any calamity coming from the earth or the heavens.\n\nThe Prophet’s (ﷺ) saying: '...and He is the All-Hearing (as-Samee’), the All-Knowing (al-Aleem)...' means that Allah is as-Samee’, Who hears the sayings of His servants, and al-Aleem, Who knows their actions. Allah is the One from Whom no secret is hidden in the earth nor in the heaven.",
      "explanation_source": "‘Fiqh al-Ad’iyah wal-Adhkar’ Shaykh Abdur-Razzaq ibn Abdul-Muhsin al-Badr, Second Edition"
    },   
    {
      "dua_in_arabic": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا",
      "dua_in_english": "I am pleased and satisfied with Allah as my Lord, with Islam as my Religion, and with Muhammad as my Prophet.",
      "hadith_in_english": "Narrated al-Munaydhr:\n\nI heard Allaah’s Messenger (ﷺ) say:\n\n\"Whoever says when he enters the morning:\n\n'I am pleased and satisfied with Allah as my Lord, with Islam as my Religion, and with Muhammad as my Prophet,'\n\nthen I guarantee that I will take hold of his hand until I enter him into Paradise.\"",
      "hadith_reference": "Abu Dāwood (no. 1529), Ibn Mājah (no. 3870), at-Tirmiidhī (no. 3389), Ahmad (4/337)—and it was graded ṣahīh by al Albānī.",
      "reference": "https://sunnah.com/hisn:87",
      "repeat": 3
    },
    {
      "dua_in_arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
      "dua_in_english": "O Ever-Living One! O Self-Subsisting Sustainer of everything! By Your mercy I beseech: rectify for me all of my affairs, and do not entrust me to my own self for the blink of an eye.",
      "hadith_in_english": "Narrated by Anas ibn Malik:\n\nThe Prophet (ﷺ) said to Fatimah:\n\n'What could prevent you from listening to what I counsel you with, or that you say when you enter the morning and when you enter the evening:\n\nO Ever-Living One! O Self-Subsisting Sustainer of everything! By Your mercy I beseech: rectify for me all of my affairs, and do not entrust me to my own self for the blink of an eye.'",
      "hadith_reference": "Amalul-Yawm wal-Laylah an-Nasa'i 575",
      "reference": "An-Nasā’ī in as-Sunan al-Kubrā (6/147), al-Hākim (1/730) who graded it ṣahīh, and adh-Dhahabī (1/545) agreed—also al-Albānī in Ṣahīh at-Targheeb wat-Tarheeb (1/273).",
      "repeat": 1
    },
    {
      "dua_in_arabic": "أَمْسَيْنَا عَلَى فِطْرَةِ الإِسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ.",
      "dua_in_english": "We have entered the evening upon the true religion of Islam, upon the testimony of the word of sincerity, upon the religion of our Prophet Muhammad (ﷺ), and upon the religion of our father Ibrahim – the one who was upright, a Muslim, and was not from among the polytheists.",
      "hadith_in_english": "Narrated by Abdur-Rahmaan ibn Abzaa:\n\nThe Prophet (ﷺ) used to say when he entered the evening:\n\n\"We have entered the evening upon the true religion of Islam, upon the testimony of the word of sincerity, upon the religion of our Prophet Muhammad (ﷺ), and upon the religion of our father Ibrahim – the one who was upright, a Muslim, and was not from among the polytheists.\"",
      "hadith_reference": "Ahmad (3/406, 407 and 5/123) and Ibn as-Sunnī in ʿAmal alYawm wal-Laylah (no. 34). Authenticated by al-Albānī,see Ṣahīh al-Jāmiʿ (no. 8803)",
      "reference": "https://sunnah.com/nasai:3409",
      "repeat": 1
    },
    {
      "dua_in_arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
      "dua_in_english": "I declare Allah free of all imperfections, and all praise is for Him.",
      "hadith_in_english": "Narrated by Abu Hurairah -radiyallaahu `anhu:\n\nThe Messenger of Allah (ﷺ) said:\n\n\"Whoever says: 'Subhan-Allahi wa bihamdihi' (I declare Allah free of all imperfections, and all praise is for Him),\n\nwhen he enters the morning, and when he enters the evening one hundred times, then no one will come on the Day of Resurrection with something better than what he comes with, except for one who said the like of what he said, or who added something upon it.\"",
      "hadith_reference": "Sahih Muslim 2692",
      "reference": "https://sunnah.com/muslim:2692",
      "repeat": 100
    },
    {
      "dua_in_arabic": "لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
      "dua_in_english": "None has the right to be worshipped except Allah, alone without partners. To Him belongs all creation and dominion, and to Him belongs all praise. He gives life and brings death, and He is all-powerful and capable over everything.",
      "hadith_in_english": "Narrated by At-Tirmidhi:\n\nThe Prophet (ﷺ) said:\n\n'Whoever recites this ten times at the end of Maghrib, Allah will send to him protectors to safeguard him from the Shayṭān (Devil) until the morning. Furthermore, Allah will write for him ten good obligatory deeds, and He will wipe away ten destructive sins, and for him will be the equivalent of freeing ten believing slaves.'",
      "hadith_reference": "At-Tirmidhi (no. 3534), graded ḥasan by al-Albānī.",
      "reference": "https://sunnah.com/tirmidhi:3534",
      "repeat": "10",
      "title": "After Maghrib"
    },
    {
      "dua_in_arabic": "لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
      "dua_in_english": "None has the right to be worshipped except Allah, alone without partners. To Him belongs all creation and dominion, and to Him belongs all praise. And He is all-powerful and capable over everything.",
      "hadith_in_english": "Narrated by an-Nasāʾī:\n\nThe Prophet (ﷺ) said:\n\n'Whoever recites this ten times in the morning receives ten good deeds, and ten sins are wiped away. He receives the reward equivalent to freeing ten slaves, and Allah protects him from the Shayṭān. And whoever recites it ten times in the evening gets the same reward. The [tired] person who makes this supplication only once in the morning will still get a reward equivalent to freeing a slave from among the descendants of the Prophet Ismāʿeel (عليه السلام). He will have ten good deeds recorded for him, ten evil deeds wiped from him, and is raised in rank by ten degrees. He will be protected from the Shayṭān till the evening. If he recites the same in the evening, he will have a similar recompense until the morning.'\n\nFurthermore, whoever recites it 100 times in a day, he receives the reward equivalent to freeing ten slaves, 100 deeds are wiped away and he is safeguarded from the Shayṭān for that day until the evening. No one comes with better than what he has except the one who has done more.",
      "hadith_reference": "An-Nasāʾī in ʿAmal al-Yawm wal-Laylah (no. 20), authenticated as ṣaḥīḥ in Ṣaḥīḥ at-Targhīb wat-Tarhīb (1/272). Abū Dāwūd (no. 5077), graded ṣaḥīḥ by al-Albānī.",
      "reference": "https://sunnah.com/nasai:20",
      "repeat": 10
    },    
    {
      "title": "Seeking refuge in the perfect words of Allah",
      "dua_in_arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
      "dua_in_english": "I seek refuge in the perfect and complete Words of Allah from the evil of whatever He has created.",
      "hadith_in_english": "Narrated by Abu Hurairah:\n\nThe Prophet (ﷺ) said: 'Whoever says three times when he enters the evening:\n\n\"I seek refuge in the perfect and complete Words of Allah from the evil of whatever He has created\"\n\nwill not be harmed by poisonous stings that night.'",
      "hadith_reference": "At-Tirmidhi (no. 3604/1)",
      "reference": "https://sunnah.com/urn:744820",
      "repeat": 3,
      "explanation": "Shaykh Abdur-Razzaq ibn Abdul-Muhsin Al-Badr (حفظه الله) said:\n\nAl-Humah refers to the sting or bite of every poisonous creature, like the scorpion and whatever is similar to it.\n\nAt the end of this Hadith, at-Tirmidhi mentions that Suhail ibn Abi Salih — one of the narrators of this Hadith — said: 'Our family members had learned this supplication, and they used to recite it every evening. Then, one of the young girls among them was stung (by a poisonous creature), yet she did not feel any pain or harm.'\n\nThis Hadith contains a clear indication of the excellence of this supplication and that whoever recites it at the onset of the evening will be protected and preserved — by the permission of Allah — from being harmed by the sting of a snake or scorpion or any similar creature.\n\nThe Prophet’s (ﷺ) saying in the Hadith: 'I seek refuge…' means to search for shelter and to hold fast to something for protection. Its reality is to flee from something which you fear, fleeing to one who can protect you from it and defend you from its evil or harm. Hence, the one who seeks refuge in Allah has fled from that which will harm him or destroy him, fleeing to his Lord and his Master, throwing himself in front of Him, clinging to Him, seeking safety through Him, and turning to Him for shelter.\n\nThe intended meaning of the Prophet’s (ﷺ) saying: '…the Words of Allah' is the Noble Qur’an. It has also been said that what is intended is His Words that contain the divine decrees which govern everything that happens in the universe. And what is meant by 'Perfect (words)…' is that His Words are complete and perfect, to the extent that they contain none of the deficiencies, defects, or shortcomings that are found in the speech of human beings.\n\nThe Prophet’s (ﷺ) saying: '…from the evil (that comes from) what He has created' — i.e., from every evil, in any created being that evil may come from, including animals or other than them, whether it be a human or a Jinn, or a crawling creature or those that walk upon four legs; or even if it be a wind or a bolt of lightning — no matter what type of calamity or affliction it might be, in this world or the hereafter. (See: 'Tayseer al-‘Azeez al-Hameed,’ by Shaykh Sulaiman ibn Abdullah, pgs. 213–214.)",
      "explanation_source": "‘Fiqh al-Ad’iyah wal-Adhkar’ Shaykh Abdur-Razzaq ibn Abdul-Muhsin al-Badr, Second Edition"
    },
    {
      "dua_in_arabic": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
      "dua_in_english": "I seek Allah’s forgiveness and repent to Him.",
      "hadith_in_english": "Narrated by the Messenger of Allah (ﷺ):\n\n'He instructed the believers to seek forgiveness as he himself would seek forgiveness 100 times each day.'\n\nIn a narration, he said: 'By Allah, I seek Allah’s forgiveness and repent to Him more than 100 times in a day.'",
      "hadith_reference": "Muslim (no. 2702), Al-Bukhārī (no. 6307).",
      "reference": "https://sunnah.com/muslim:2702",
      "repeat": 100
    },    
    {
      "title": "Allah is Sufficient for Me; Upon Him, Alone, I Rely and Depend",
      "dua_in_arabic": "حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
      "dua_in_english": "Allah is sufficient for me; there is none who deserves to be worshipped except Him; I rely upon Him, and He is the Lord of the Magnificent Throne.",
      "hadith_in_english": "From among the words of remembrance to be recited at both ends of the day (i.e., morning and evening) is that which is reported by Ibn Sunnee, from Aboo ad-Dardaa’ (رضي الله عنه), from the Prophet (ﷺ):\n\n'Whoever recites seven times — every day — when he reaches the morning and when he reaches the evening:\n\n“Allah is sufficient for me; there is none who deserves to be worshipped except Him; I rely upon Him, and He is the Lord of the Magnificent Throne,”\n\nAllah will suffice him his concerns from the affairs of this world and the Hereafter.'\n\n[Fortress of the Muslim, no. 83. Reported by Ibn Sunnee in ‘Amal al-Yawm wal-Laylah,’ no. 71, as a Marfoo’ Hadith [i.e., attributed to the Prophet (ﷺ) as his statement].\n\nIt has also been reported by Aboo Daawood in his ‘Sunan,’ no. 5081, with a chain of narrators who are all reliable, as a Mawqoof statement [i.e., attributed to a companion (RadiyAllāhu ‘an-hu)].\n\nal-Albānee (Rahimahullāh) declared it to be authentic in Silsilatul-Ahadeeth ad-Da’eefah, no. 5286, as a Mawqoof statement [i.e., as a statement of Aboo ad-Dardā’ (RadiyAllāhu ‘an-hu)].\n\nAnd this kind of statement cannot be made simply based upon opinion and independent judgment; rather, it could only have come by way of being heard from the Prophet (ﷺ)].",
      "hadith_reference": "Fortress of the Muslim, no. 83",
      "reference": "https://sunnah.com/",
      "repeat": 7,
      "explanation": "Shaykh Abdur-Razzaq ibn Abdul-Muhsin Al-Badr (حفظه الله) said:\n\nThis blessed statement of praise of Allah contains a far-reaching effect and a tremendous benefit in every matter which is important to a Muslim, from the affairs of this world and the Hereafter. The meaning of HasbiyAllah is that Allah will give me that which is sufficient for all of my needs.\n\n[Translator’s Note: This supplication, which the Prophet (ﷺ) has ordered us to recite, also came in the saying of Allah, the Most High:\n\n“...And if they turn away, then say: Allah is sufficient for me; there is none who deserves to be worshipped except Him; I rely upon Him, and He is the Lord of the Magnificent Throne.” (Qur’an, 9:129)]\n\nThe meaning of this Ayah is that if the disbelievers turn away from what you have come to them with, i.e., this comprehensive, perfect, pure, magnificent divine law — then recite to them this supplication:\n\n- HasbiyAllah: Allah is sufficient for me.\n- La ilaha illa Huwa: There is nothing that is worthy of being worshipped except Him.\n- ‘Alaihi Tawakkaltu: I have depended/rely upon Him, and surrendered all of my affairs to Him.\n- Wa Huwa Rabbul-‘Arshil-‘Adheem: He is the Master and Creator of everything. Since He is the Rabb (Lord) of the Magnificent Throne — and the Prophet (ﷺ) singled out the Throne for special mention since it is the greatest of all creations — hence, everything (created) that is less than the Throne is more rightly so included (as being under the lordship and mastery of the One Who is Lord and Master of the Magnificent Throne).",
      "explanation_source": "‘Fiqh al-Ad’iyah wal-Adhkar’ Shaykh Abdur-Razzaq ibn Abdul-Muhsin al-Badr, Second Edition"
    } 
  ]
}